app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.create(ticket_params)
    if @ticket.save
---
INSERT INTO "tickets" ("code", "time_slot", "event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["code", ""], ["time_slot", "05:00:00"], ["event_id", 2], ["user_id", 1], ["created_at", "2020-07-22 18:54:18.237093"], ["updated_at", "2020-07-22 18:54:18.237093"]]
UPDATE "tickets" SET "code" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["code", "5154a59f4ab83d4eba032440a2eeddc8"], ["updated_at", "2020-07-22 18:33:36.390026"], ["id", 2]]
INSERT INTO "tickets" ("code", "time_slot", "event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["code", "jifafanfaffojiojewoewr4i989"], ["time_slot", "05:30:00"], ["event_id", 2], ["user_id", 1], ["created_at", "2020-07-22 18:33:36.378230"], ["updated_at", "2020-07-22 18:33:36.378230"]]