app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "age", "email", "mobile_phone", "profile_imgURL", "id_imgURL", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "profile_imgURL" = $1, "updated_at" = $2 WHERE "users"."id" = $3
---
  def update
    if @user.update(user_params)